{
  "user": {
    "name": "Piero",
    "title": "Frontend Developer"
  },
  "interactiveBlocks": {
    "aboutMe": {
      "title": {
        "en": "About Me",
        "es": "Sobre Mí"
      },
      "description": {
        "en": "I'm a developer passionate about creating interactive web experiences. I love combining code and creativity.",
        "es": "Soy un desarrollador apasionado por crear experiencias web interactivas. Me encanta combinar código y creatividad."
      },
      "link": "#"
    },
    "project": {
      "title": {
        "en": "My Best Project",
        "es": "Mi Mejor Proyecto"
      },
      "description": {
        "en": "This is an awesome project I made using Three.js.",
        "es": "Este es un proyecto increíble que hice usando Three.js."
      },
      "link": "#"
    },
    "chest": {
      "type": "chest",
      "items": [
        {
          "name": "Resume (PDF)",
          "icon": "assets/textures/assets/minecraft/textures/block/book_box_a.png",
          "description": "Downloadable resume (PDF) — frontend, UX, 3D web.",
          "link": "#"
        },
        {
          "name": "GitHub",
          "icon": "assets/textures/assets/minecraft/textures/block/bookshelf.png",
          "description": "My GitHub with projects and demos.",
          "link": "#"
        },
        {
          "name": "Secret Demo",
          "icon": "assets/textures/assets/minecraft/textures/block/diamond_block.png",
          "description": "A small interactive demo packed inside the chest.",
          "link": "#"
        },
        {
          "name": "Contact",
          "icon": "assets/textures/assets/minecraft/textures/block/enchanting_table_top.png",
          "description": "Contact links and freelance availability.",
          "link": "#"
        }
      ]
    },
    "ore": {
      "type": "ore",
      "title": "Hidden Mine",
      "description": "You found a vein. Use a Diamond Pickaxe to mine and reveal a demo.",
      "link": "#"
    }
  },
  "projects": [
    {
      "title": {
        "en": "Spotify Album Manager",
        "es": "Gestor de Álbumes de Spotify"
      },
      "description": {
        "en": "A web app to manage your saved Spotify albums, built with React, TypeScript, and the Spotify API.",
        "es": "Una app web para gestionar tus álbumes guardados de Spotify, creada con React, TypeScript y la API de Spotify."
      },
      "longDescription": {
        "en": "This application allows users to connect to their Spotify account to view, filter, and organize their saved albums. It offers a clean and intuitive interface for managing a large music library, demonstrating strong skills in API integration and state management with Redux.",
        "es": "Esta aplicación permite a los usuarios conectar su cuenta de Spotify para ver, filtrar y organizar sus álbumes guardados. Ofrece una interfaz limpia e intuitiva para gestionar una gran biblioteca musical, demostrando habilidades en integración de APIs y manejo de estado con Redux."
      },
      "link": "https://github.com/pierox-afk/spotify-album-manager",
      "icon": "assets/textures/assets/minecraft/textures/block/jukebox_side.png",
      "technologies": [
        "React",
        "TypeScript",
        "Redux Toolkit",
        "Spotify API",
        "CSS Modules"
      ],
      "images": [
        "assets/textures/spoti/image1.jpg",
        "assets/textures/spoti/image2.jpg",
        "assets/textures/spoti/image3.jpg"
      ]
    },
    {
      "title": {
        "en": "PokéAPI Explorer",
        "es": "Explorador PokéAPI"
      },
      "description": {
        "en": "An interactive Pokémon encyclopedia using the PokéAPI to fetch and display data on different Pokémon.",
        "es": "Una enciclopedia interactiva de Pokémon que usa la PokéAPI para obtener y mostrar datos de diferentes Pokémon."
      },
      "longDescription": {
        "en": "An interactive Pokémon encyclopedia built with vanilla JavaScript, HTML, and CSS. It uses the PokéAPI to dynamically fetch and display detailed information about different Pokémon, including their stats, abilities, and types. The project focuses on asynchronous data handling and DOM manipulation.",
        "es": "Una enciclopedia interactiva de Pokémon construida con JavaScript, HTML y CSS. Usa la PokéAPI para obtener y mostrar dinámicamente información detallada sobre diferentes Pokémon, incluyendo sus estadísticas, habilidades y tipos. El proyecto se centra en el manejo de datos asíncronos y la manipulación del DOM."
      },
      "link": "https://github.com/pierox-afk/POKE-API",
      "icon": "assets/textures/assets/minecraft/textures/item/compass_00.png",
      "technologies": [
        "JavaScript (ES6+)",
        "HTML5",
        "CSS3",
        "REST API",
        "Webpack"
      ],
      "images": [
        "assets/textures/pokem/image1.png",
        "assets/textures/pokem/image2.png",
        "assets/textures/pokem/image3.png"
      ]
    },
    {
      "title": {
        "en": "This Portfolio",
        "es": "Este Portafolio"
      },
      "description": {
        "en": "An interactive portfolio built with vanilla JavaScript.",
        "es": "Un portafolio interactivo construido con JavaScript."
      },
      "longDescription": {
        "en": "The portfolio you are currently viewing. It's an immersive web experience inspired by Minecraft, created from scratch using vanilla JavaScript for all interactions. It features custom animations, sound effects, and a unique 'dimension-travel' theme to navigate between sections.",
        "es": "El portafolio que estás viendo. Es una experiencia web inmersiva inspirada en Minecraft, creada desde cero usando JavaScript para las interacciones. Incluye animaciones, efectos de sonido y un tema de 'viaje dimensional' para navegar."
      },
      "link": "https://github.com/pierox-afk/portfolio-interactive",
      "icon": "assets/textures/assets/minecraft/textures/block/crafting_table_front.png",
      "technologies": ["JavaScript", "HTML5", "CSS3", "Web Audio API"],
      "images": [
        "assets/textures/portfolio/image1.jpg",
        "assets/textures/portfolio/image2.jpg",
        "assets/textures/portfolio/image3.jpg",
        "assets/textures/portfolio/image4.jpg"
      ]
    }
  ],
  "resume": {
    "name": "Piero Sansossio",
    "location": "Buenos Aires",
    "birthDate": "September 10, 2002",
    "gender": "Hombre",
    "linkedin": "https://linkedin.com/in/pierosansossio-590877291",
    "upwork": "#",
    "phone": "Contact for details",
    "profile": {
      "en": "I am a Frontend Developer with 4 years of experience creating scalable, interactive, and high-performance User Interfaces (UI). My specialization is focused on the architecture and refactoring of complex codebases using React and TypeScript, ensuring production quality and efficiency.",
      "es": "Soy un Desarrollador Frontend con 4 años de experiencia creando Interfaces de Usuario (UI) escalables, interactivas y de alto rendimiento. Mi especialización se centra en la arquitectura y refactorización de bases de código complejas usando React y TypeScript, garantizando calidad y eficiencia en producción."
    },
    "profileSummary": {
      "en": "My approach is to create solutions that not only function correctly but are also scalable and maintainable.",
      "es": "Mi enfoque es crear soluciones que no solo funcionen correctamente, sino que también sean escalables y mantenibles."
    },
    "skills": [
      "JavaScript",
      "React",
      "Vue.js",
      "TypeScript",
      "Redux Toolkit",
      "Context API",
      "HTML5",
      "CSS3",
      "DOM Manipulación",
      "Desarrollo UI/UX",
      "Github",
      "React Testing Library",
      "Redux Toolkit",
      "Tailwind CSS",
      "RESTful APIs",
      "Responsive Design",
      "Jest",
      "Vue.js"
    ],
    "languages": ["Inglés", "Español"],
    "education": {
      "degree": "Bachelors",
      "institution": "Jose Antonio Paez University, Valencia, Venezuela",
      "period": "Oct 2019 - Present",
      "description": {
        "en": "<strong>Frameworks & State Management:</strong> Proficient in React and Vue.js, with advanced state management using Redux Toolkit and the Context API.<br><br><strong>Design & Performance:</strong> Expert in UI/UX Development and Responsive Design, utilizing Tailwind CSS. I actively implement performance optimization strategies (code splitting, lazy loading) which have resulted in a 30% reduction in main page load time.<br><br><strong>Quality & Stability:</strong> Proven experience writing unit and integration tests with Jest and React Testing Library to ensure stability and architectural soundness.<br><br><strong>Data Integration:</strong> Solid experience integrating RESTful APIs and WebSockets to handle real-time data efficiently.",
        "es": "<strong>Frameworks y Manejo de Estado:</strong> Competente en React y Vue.js, con manejo de estado avanzado usando Redux Toolkit y la Context API.<br><br><strong>Diseño y Rendimiento:</strong> Experto en Desarrollo UI/UX y Diseño Responsivo, utilizando Tailwind CSS. Implemento activamente estrategias de optimización de rendimiento (code splitting, lazy loading) que han resultado en una reducción del 30% en el tiempo de carga de la página principal.<br><br><strong>Calidad y Estabilidad:</strong> Experiencia demostrada escribiendo pruebas unitarias y de integración con Jest y React Testing Library para asegurar la estabilidad y solidez de la arquitectura.<br><br><strong>Integración de Datos:</strong> Sólida experiencia integrando APIs RESTful y WebSockets para manejar datos en tiempo real de manera eficiente."
      }
    }
  }
}
